Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ2025DAG169.atdf
         <register caption="" name="GLCDCLUT5" offset="0x414" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT6" offset="0x418" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT7" offset="0x41C" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT8" offset="0x420" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT9" offset="0x424" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT10" offset="0x428" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT11" offset="0x42C" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT12" offset="0x430" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT13" offset="0x434" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT14" offset="0x438" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT15" offset="0x43C" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT16" offset="0x440" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT17" offset="0x444" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT18" offset="0x448" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT19" offset="0x44C" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT20" offset="0x450" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT21" offset="0x454" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT22" offset="0x458" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT23" offset="0x45C" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT24" offset="0x460" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT25" offset="0x464" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT26" offset="0x468" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT27" offset="0x46C" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT28" offset="0x470" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT29" offset="0x474" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT30" offset="0x478" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT31" offset="0x47C" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
