Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ2025DAG169.atdf
         <register caption="Type B Timer Control Register" name="T5CON" offset="0x600" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T5CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T5CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T5CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T5CON__TGATE" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T5CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T5CON__ON" />
         </register>
         <register caption="Type B Timer Control Register" name="T6CON" offset="0x800" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T6CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T6CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T6CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T6CON__TGATE" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T6CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T6CON__ON" />
         </register>
         <register caption="Type B Timer Control Register" name="T7CON" offset="0xA00" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T7CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T7CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T7CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T7CON__TGATE" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T7CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T7CON__ON" />
         </register>
         <register caption="Type B Timer Control Register" name="T8CON" offset="0xC00" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T8CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T8CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T8CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T8CON__TGATE" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T8CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T8CON__ON" />
         </register>
         <register caption="Type B Timer Control Register" name="T9CON" offset="0xE00" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T9CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T9CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T9CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T9CON__TGATE" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T9CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T9CON__ON" />
         </register>
         <register caption="Timer Count Register Bits" name="TMR2" offset="0x10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR2" />
         </register>
         <register caption="" name="TMR3" offset="0x210" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR3" />
         </register>
         <register caption="" name="TMR4" offset="0x410" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR4" />
         </register>
         <register caption="" name="TMR5" offset="0x610" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR5" />
         </register>
         <register caption="" name="TMR6" offset="0x810" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR6" />
         </register>
         <register caption="" name="TMR7" offset="0xA10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR7" />
         </register>
         <register caption="" name="TMR8" offset="0xC10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR8" />
         </register>
         <register caption="" name="TMR9" offset="0xE10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR9" />
         </register>
         <register caption="Period Register Bits" name="PR2" offset="0x20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PR2" />
         </register>
         <register caption="" name="PR3" offset="0x220" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PR3" />
         </register>
         <register caption="" name="PR4" offset="0x420" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PR4" />
         </register>
         <register caption="" name="PR5" offset="0x620" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PR5" />
         </register>
         <register caption="" name="PR6" offset="0x820" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PR6" />
         </register>
         <register caption="" name="PR7" offset="0xA20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PR7" />
         </register>
         <register caption="" name="PR8" offset="0xC20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PR8" />
         </register>
         <register caption="" name="PR9" offset="0xE20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PR9" />
         </register>
      </register-group>
