Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ2025DAG169.atdf
         <register caption="UARTx Status and Control Register" name="U6STA" offset="0xA10" rw="RW" size="4">
            <bitfield caption="Receive Buffer Data Available bit (read-only)" mask="0x00000001" name="URXDA" values="U6STA__URXDA" />
            <bitfield caption="Receive Buffer Overrun Error Status bit." mask="0x00000002" name="OERR" values="U6STA__OERR" />
            <bitfield caption="Framing Error Status bit (read-only)" mask="0x00000004" name="FERR" values="U6STA__FERR" />
            <bitfield caption="Parity Error Status bit (read-only)" mask="0x00000008" name="PERR" values="U6STA__PERR" />
            <bitfield caption="Receiver Idle bit (read-only)" mask="0x00000010" name="RIDLE" values="U6STA__RIDLE" />
            <bitfield caption="Address Character Detect bit (bit 8 of received data = 1)" mask="0x00000020" name="ADDEN" values="U6STA__ADDEN" />
            <bitfield caption="Receive Interrupt Mode Selection bit" mask="0x000000C0" name="URXISEL" values="U6STA__URXISEL" />
            <bitfield caption="Transmit Shift Register is Empty bit (read-only)" mask="0x00000100" name="TRMT" values="U6STA__TRMT" />
            <bitfield caption="Transmit Buffer Full Status bit (read-only)" mask="0x00000200" name="UTXBF" values="U6STA__UTXBF" />
            <bitfield caption="Transmit Enable bit" mask="0x00000400" name="UTXEN" values="U6STA__UTXEN" />
            <bitfield caption="Transmit Break bit" mask="0x00000800" name="UTXBRK" values="U6STA__UTXBRK" />
            <bitfield caption="Receiver Enable bit" mask="0x00001000" name="URXEN" values="U6STA__URXEN" />
            <bitfield caption="Transmit Polarity Inversion bit" mask="0x00002000" name="UTXINV" values="U6STA__UTXINV" />
            <bitfield caption="TX Interrupt Mode Selection bits" mask="0x0000C000" name="UTXISEL" values="U6STA__UTXISEL" />
            <bitfield mask="0x00FF0000" name="ADDR" />
            <bitfield caption="UARTx Address Match Mask bits" mask="0xFF000000" name="MASK" values="U6STA__MASK" />
         </register>
         <register caption="" name="U1TXREG" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="U1TXREG" />
         </register>
         <register caption="" name="U2TXREG" offset="0x220" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="U2TXREG" />
         </register>
         <register caption="" name="U3TXREG" offset="0x420" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="U3TXREG" />
         </register>
         <register caption="" name="U4TXREG" offset="0x620" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="U4TXREG" />
         </register>
         <register caption="" name="U5TXREG" offset="0x820" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="U5TXREG" />
         </register>
         <register caption="" name="U6TXREG" offset="0xA20" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="U6TXREG" />
         </register>
         <register caption="" name="U1RXREG" offset="0x30" rw="R" size="4">
            <bitfield mask="0x000001FF" name="U1RXREG" />
         </register>
         <register caption="" name="U2RXREG" offset="0x230" rw="R" size="4">
            <bitfield mask="0x000001FF" name="U2RXREG" />
         </register>
         <register caption="" name="U3RXREG" offset="0x430" rw="R" size="4">
            <bitfield mask="0x000001FF" name="U3RXREG" />
         </register>
         <register caption="" name="U4RXREG" offset="0x630" rw="R" size="4">
            <bitfield mask="0x000001FF" name="U4RXREG" />
         </register>
         <register caption="" name="U5RXREG" offset="0x830" rw="R" size="4">
            <bitfield mask="0x000001FF" name="U5RXREG" />
         </register>
         <register caption="" name="U6RXREG" offset="0xA30" rw="R" size="4">
            <bitfield mask="0x000001FF" name="U6RXREG" />
         </register>
         <register caption="" name="U1BRG" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x000FFFFF" name="BRG" />
         </register>
         <register caption="" name="U2BRG" offset="0x240" rw="RW" size="4">
            <bitfield mask="0x000FFFFF" name="BRG" />
         </register>
         <register caption="" name="U3BRG" offset="0x440" rw="RW" size="4">
            <bitfield mask="0x000FFFFF" name="BRG" />
         </register>
         <register caption="" name="U4BRG" offset="0x640" rw="RW" size="4">
            <bitfield mask="0x000FFFFF" name="BRG" />
         </register>
         <register caption="" name="U5BRG" offset="0x840" rw="RW" size="4">
            <bitfield mask="0x000FFFFF" name="BRG" />
         </register>
         <register caption="" name="U6BRG" offset="0xA40" rw="RW" size="4">
            <bitfield mask="0x000FFFFF" name="BRG" />
         </register>
      </register-group>
      <value-group caption="Stop Selection bit" name="U1MODE__STSEL">
         <value caption="2 Stop bits" name="2_STOPBITS" value="0x1" />
         <value caption="1 Stop bit" name="1_STOPBIT" value="0x0" />
      </value-group>
      <value-group caption="Parity and Data Selection bits" name="U1MODE__PDSEL">
         <value caption="9-bit data, no parity" name="9BITS_NOPARITY" value="0x3" />
         <value caption="8-bit data, odd parity" name="8BITS_ODDPARITY" value="0x2" />
         <value caption="8-bit data, even parity" name="8BITS_EVENPARITY" value="0x1" />
         <value caption="8-bit data, no parity" name="8BITS_NOPARITY" value="0x0" />
      </value-group>
      <value-group caption="High Baud Rate Enable bit" name="U1MODE__BRGH">
         <value caption="High-Speed mode 4x baud clock enabled" name="HIGH_SPEED" value="0x1" />
         <value caption="Standard Speed mode 16x baud clock enabled" name="STD_SPEED" value="0x0" />
      </value-group>
      <value-group caption="Receive Polarity Inversion bit" name="U1MODE__RXINV">
         <value caption="UxRX Idle state is 0" name="" value="0x1" />
         <value caption="UxRX Idle state is 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Auto-Baud Enable bit" name="U1MODE__ABAUD">
         <value caption="Enable baud rate measurement on the next character requires reception of Sync character (0x55); cleared by hardware upon completion" name="" value="0x1" />
         <value caption="Baud rate measurement disabled or completed" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Loopback Mode Select bit" name="U1MODE__LPBACK">
         <value caption="Loopback mode is enabled" name="" value="0x1" />
         <value caption="Loopback mode is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" name="U1MODE__WAKE">
         <value caption="Wake-up enabled" name="" value="0x1" />
         <value caption="Wake-up disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Module Enable bits" name="U1MODE__UEN">
         <value caption="UxTX" name="" value="0x3" />
         <value caption="UxTX" name="" value="0x2" />
         <value caption="UxTX" name="" value="0x1" />
         <value caption="UxTX and UxRX pins are enabled and used; UxCTS and UxRTS/UxBCLK pins are controlled by corresponding bits in the PORTx register" name="" value="0x0" />
      </value-group>
      <value-group caption="Mode Selection for UxRTS Pin bit" name="U1MODE__RTSMD">
         <value caption="UxRTS pin is in Simplex mode" name="" value="0x1" />
         <value caption="UxRTS pin is in Flow Control mode" name="" value="0x0" />
      </value-group>
      <value-group caption="IrDA  Encoder and Decoder Enable bit" name="U1MODE__IREN">
         <value caption="IrDA is enabled" name="" value="0x1" />
         <value caption="IrDA is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="U1MODE__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Enable bit" name="U1MODE__ON">
         <value caption="UARTx module is enabled. UARTx pins are controlled by UARTx as defined by UEN and UTXEN control bits" name="" value="0x1" />
         <value caption="UARTx module is disabled. All UARTx pins are controlled by corresponding bits in the PORTx" name="" value="0x0" />
      </value-group>
